"""                                     Модуль 8. Серіалізація та копіювання об'єктів в Python

                        Вступ
                        
У цьому модулі ми розберемося, як передавати, шифрувати та дешифрувати потоки даних.

Розглянемо такі теми:

- Серіалізація об'єктів Python
- Серіалізація об'єктів за допомогою pickle
- Серіалізація за допомогою JSON
- Робота з таблицями CSV
- Управління порядком серіалізації
- Створення копій об'єктів
- Створення поверхневих копій об'єктів
- Управління порядком копіювання об'єктів Python

В результаті проходження модуля, ти дізнаєшся, що таке серіалізація та як дані в програмі передаються між різними 
модулями.                        """