"""                                     Модуль 8. Серіалізація та копіювання об'єктів в Python

                        Вступ
                        
У цьому модулі ми розберемося, як передавати, шифрувати та дешифрувати потоки даних.

Розглянемо такі теми:

- Серіалізація об'єктів Python
- Серіалізація об'єктів за допомогою pickle
- Серіалізація за допомогою JSON
- Робота з таблицями CSV
- Управління порядком серіалізації
- Створення копій об'єктів
- Створення поверхневих копій об'єктів
- Управління порядком копіювання об'єктів Python

В результаті проходження модуля, ти дізнаєшся, що таке серіалізація та як дані в програмі передаються між різними 
модулями.


                        Серіалізація об'єктів в Python
                        
Серіалізація об'єктів в Python — це процес перетворення структури даних або об'єкта в потік байтів для зберігання 
або передачі. Цей потік байтів може бути збережений у файлі, переданий через мережу або навіть використаний для 
зберігання в базі даних. Ціль серіалізації — зберегти стан об'єкта так, щоб його можна було відновити в майбутньому. 
Процес відновлення стану об'єкта з серіалізованої форми називається десеріалізацією.

Завжди, коли потрібно зберегти інформацію для подальшого використання в зрозумілій комп'ютеру формі, робимо 
серіалізацію. Найочевидніший приклад — це збереження даних у текстовий файл. Ти можеш зберегти, наприклад, перелік 
витрат у текстовий файл:"""

expenses = {"hotel": 150, "breakfast": 30, "taxi": 15, "lunch": 20}

file_name = "expenses.txt"
with open(file_name, "w") as fh:
    for key, value in expenses.items():
        fh.write(f"{key}|{value}\n")

""" Цей файл буде повністю читабельним:

hotel|150
breakfast|30
taxi|15
lunch|20

Якщо потім знадобиться завантажити цей перелік назад у Python, завжди є змога це зробити:"""

file_name = "expenses.txt"
expenses = {}

with open(file_name, "r") as fh:
    raw_expenses = fh.readlines()
    for line in raw_expenses:
        key, value = line.split("|")
        expenses[key] = int(value)

print(expenses)

""" Виведення:{'hotel': 150, 'breakfast': 30, 'taxi': 15, 'lunch': 20}

У цьому примітивному прикладі ми серіалізували та десеріалізували словник expenses. Такий підхід цілком виправданий, 
особливо, якщо варто зберегти інформативний вигляд інформації.

Однак, далеко не завжди такий підхід виправданий. Зауваж, що у цьому прикладі довелося винайти свій протокол 
серіалізації. А саме:
- символ нового рядка вказує на початок нової пари ключ-значення;
- символ | розділяє ключ і значення
- значення потрібно перетворити з рядкового представлення на числову форму.

Для роботи з даними, серіалізованими за цим протоколом, необхідно буде пам'ятати про нього та розширювати протокол 
за потребою.

Можна піти іншим шляхом та скористатися одним із стандартних протоколів. За такого підходу можна зекономити, 
використовуючи готове та протестоване рішення.

Python надає декілька модулів для серіалізації, найпопулярнішими з яких є pickle і json.
- вбудований пакет pickle дозволяє працювати з вбудованими типами (словники, списки, кортежі, рядки, множини та ін.) 
і навіть з нескладними класами;
- формат JSON підтримується Python і з невеликими обмеженнями дозволяє працювати з рядками, числами, списками, 
кортежами та словниками.

Обидва ці методи мають свої переваги та обмеження. Pickle має високу гнучкість і дозволяє серіалізувати складні 
об'єкти, але може бути небезпечним при десеріалізації даних зі сторонніх джерел. JSON є більш обмеженим у типах 
даних, які можуть бути серіалізовані, але забезпечує кращу багатоплатформову сумісність і безпеку."""