"""                                         Управління порядком серіалізації та копіювання об'єктів

                        Управління порядком серіалізації


Нагадаємо, що серіалізація - це процес перетворення об'єкта у потік байтів для зберігання або передачі. Десеріалізація - 
зворотний процес, коли потік байтів перетворюється назад у об'єкт. Але не всі об'єкти Python можна серіалізувати. Наприклад, 
не можна серіалізувати файловий дескриптор або системний ресурс. Тоді, що робити, коли є клас, об'єкт який треба запакувати, 
використовуючи pickle, але у нього є атрибути, що не серіалізуються? У такій ситуації можна скористатися магічними методами, 
які управляють серіалізацією та десеріалізацією за допомогою pickle.

Методи __getstate__ і __setstate__ в Python дозволяють нам контролювати, як об'єкт повинен бути серіалізований та 
десеріалізований модулем pickle.

Коли викликається pickle.dump() або pickle.dumps() для серіалізації об'єкта, Python шукає метод __getstate__ у класі об'єкта. 
Якщо метод існує, він використовується для отримання стану об'єкта для серіалізації. При десеріалізації, за допомогою 
pickle.load() або pickle.loads(), Python шукає метод __setstate__ у класі. Якщо метод існує, він використовується для 
відновлення стану об'єкта з даних, отриманих під час десеріалізації.

Припустимо, у нас є клас Robot, який містить інформацію про робота, але ми хочемо серіалізувати лише певні атрибути."""

import pickle

class Robot:
    def __init__(self, name, battery_life):
        self.name = name
        self.battery_life = battery_life
        # Цей атрибут ми не збираємось серіалізувати
        self.is_active = False  

    def __getstate__(self):
        state = self.__dict__
        # Видаляємо is_active з серіалізованого стану
        del state['is_active']
        return state

    def __setstate__(self, state):
        # Відновлюємо об'єкт при десеріалізації
        self.__dict__.update(state)
        # Задаємо значення is_active за замовчуванням
        self.is_active = False  

# Створення об'єкта Robot
robot = Robot("Robo1", 100)

# Серіалізація об'єкта
serialized_robot = pickle.dumps(robot)

# Десеріалізація об'єкта
deserialized_robot = pickle.loads(serialized_robot)

print(deserialized_robot.__dict__)

# Виведення:
# {'name': 'Robo1', 'battery_life': 100, 'is_active': False}

"""Це досить штучний приклад, де __getstate__ модифікує стан об'єкта перед серіалізацією, видаляючи атрибут is_active, 
тому що ми вирішили, що цей атрибут не потрібно зберігати. Метод __setstate__ відновлює стан об'єкта при десеріалізації, 
встановлюючи is_active назад на значення за замовчуванням, оскільки цей атрибут не був збережений.

Для цих операцій ми використовуємо self.__dict__, який є спеціальним атрибутом об'єкта, що містить словник з усіма атрибутами, 
які належать до цього об'єкта. Ключі у цьому словнику відповідають іменам атрибутів, а значення — це відповідні значення цих 
атрибутів. Коли ми створюємо новий екземпляр класу, Python автоматично створює словник __dict__ для цього екземпляра, щоб 
зберігати всі атрибути, які додаються до цього об'єкта.

Пояснимо на простому прикладі, маємо простий клас:"""
class Example:
    def __init__(self, name, age):
        self.name = name
        self.age = age

# Коли ми створюємо екземпляр цього класу:

obj = Example("Gupalo Vasyl", 30)

# То obj.__dict__ міститиме:
# {'name': 'Gupalo Vasyl', 'age': 30}
# Ми можемо динамічно додавати, видаляти або змінювати атрибути:

obj.__dict__['city'] = 'Poltava'  # Додавання нового атрибута
print(obj.city)  # Виведення: Poltava

del obj.__dict__['age']  # Видалення атрибута age
print(obj.__dict__)  # Виведення: {'name': 'Gupalo Vasyl', 'city': 'Poltava'}

""" Однак, це слід робити дуже обережно, оскільки необдумані зміни можуть призвести до непередбачуваної поведінки 
об'єкта. У нашому прикладі, ми використовуємо self.__dict__ для копіювання всіх атрибутів об'єкта Robot при реалізації 
методів __getstate__ і __setstate__, що дозволяє зберігати і відновлювати стан об'єкта при роботі з модулем pickle.

Більш практично ця техніка використовується для об'єктів, що містять несеріалізовані атрибути, такі як відкриті файли 
або з'єднання з базами даних. Розглянемо наступний приклад, який визначає клас Reader для читання даних з файлу. Клас 
простий, з методами для ініціалізації та закриття файлового дескриптора, а також методом для читання вмісту файлу."""

class Reader:
    def __init__(self, filename):
        self.filename = filename
        self.fh = open(self.filename, "r", encoding="utf-8")

    def close(self):
        self.fh.close()

    def read(self):
        data = self.fh.read()
        return data

if __name__ == "__main__":
    reader = Reader("data.txt")
    data = reader.read()
    print(data)
    reader.close()

# Якщо створити текстовий файл "data.txt", наприклад з рядком тексту "Message from file", то виведення буде наступним.
# Message from file

""" Однак, є важлива особливість стосовно використання цього класу з бібліотеками серіалізації, такими як pickle. Якщо
ми захочемо серіалізувати наш об'єкт reader то отримаємо помилку.

import pickle

class Reader:
    def __init__(self, filename):
        self.filename = filename
        self.fh = open(self.filename, "r", encoding="utf-8")

    def close(self):
        self.fh.close()

    def read(self):
        data = self.fh.read()
        return data

if __name__ == "__main__":
    reader = Reader("data.txt")
    # Приклад серіалізації об'єкта Reader
    with open("reader.pkl", "wb") as f:
        pickle.dump(reader, f)

При намаганні серіалізувати екземпляр класу Reader за допомогою pickle, виникає помилка, оскільки файловий дескриптор 
self.fh не може бути серіалізованим. Вона виникає тому, що файлові дескриптори не підлягають серіалізації pickle через 
їх залежність від зовнішніх системних ресурсів, які pickle не може зберегти та відновити.

Traceback (most recent call last):
  File "E:\\WebDir\\Works\\Python\\python-help-solution\\core_course\\topic8\\ex_pickle\\ex09.py", line 21, in <module>
    pickle.dump(reader, f)
TypeError: cannot pickle '_io.TextIOWrapper' object

Для того, щоб зробити екземпляри класу Reader серіалізованими, нам необхідно реалізувати методи __getstate__ та __setstate__ 
та керувати поведінкою pickle для класу. Це дозволить нам явно визначити, яка частина об'єкта має бути серіалізована, та як 
об'єкт має бути відновлений.

У наступному прикладі клас Reader можна серіалізувати і помилки через неможливість упакувати файловий дескриптор вже не виникне."""

import pickle

class Reader:
    def __init__(self, filename):
        self.filename = filename
        self.fh = open(self.filename, "r", encoding="utf-8")

    def close(self):
        self.fh.close()

    def read(self):
        data = self.fh.read()
        return data

    def __getstate__(self):
        attributes = {**self.__dict__, "fh": None}
        return attributes

    def __setstate__(self, state):
        # Відновлюємо стан об'єкта
        self.__dict__ = state
        self.fh = open(state["filename"], "r", encoding="utf-8")

if __name__ == "__main__":
    reader = Reader("data.txt")
    data = reader.read()
    print(data)
    reader.close()

    # Приклад серіалізації об'єкта Reader
    with open("reader.pkl", "wb") as f:
        pickle.dump(reader, f)

    # Приклад десеріалізації об'єкта Reader
    with open("reader.pkl", "rb") as f:
        loaded_reader = pickle.load(f)
        print(loaded_reader.read())
        loaded_reader.close()

""" У цій модифікованій версії, метод __getstate__ створює копію словника атрибутів об'єкта з self.__dict__, але 
замінює fh на None, щоб уникнути спроби серіалізації відкритого файлового дескриптора.

    ☝ Файловий дескриптор self.fh не включений до стану, тому що він не може бути серіалізованим.

Метод __setstate__ відновлює стан об'єкта зі стану, отриманого при десеріалізації, і відкриває файл знову, 
використовуючи збережене ім'я файлу. 

Це дозволяє нам знову отримати доступ до вмісту файлу після десеріалізації.

Загалом наша реалізація ефективно вирішує проблему з неможливістю серіалізації файлових дескрипторів і дозволяє 
безпечно зберігати та відновлювати стан об'єктів, що працюють з файлами.


"""